
## Plan Result (prod)




### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 4 to add, 2 to change, 2 to destroy.</code></pre>

* Create
  * module.dm_store_storage_account.time_rotating.rotate
  * module.storage_account.time_rotating.rotate
* Update
  * module.dm_store_storage_account.azurerm_storage_account.storage_account
  * module.storage_account.azurerm_storage_account.storage_account
* Replace
  * module.dm_store_storage_account.time_static.pim_expiry
  * module.storage_account.time_static.pim_expiry


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.dm_store_storage_account.azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
      ~ cross_tenant_replication_enabled  = true -> false
        id                                = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/ccd-shared-prod/providers/Microsoft.Storage/storageAccounts/dmstoredocprod"
        name                              = "dmstoredocprod"
        tags                              = {
            "Destroy Me"          = "No"
            "Team Contact"        = "#em-dev-chat"
            "application"         = "evidence-management"
            "builtFrom"           = "https://github.com/HMCTS/ccd-shared-infrastructure.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#em-dev-chat"
            "environment"         = "production"
            "managedBy"           = "Evidence Management"
        }
        # (39 unchanged attributes hidden)

      ~ network_rules {
          ~ ip_rules                   = [
              - "109.159.86.122",
              - "149.50.162.254",
              - "149.50.163.165",
              - "188.74.124.208",
              - "188.74.98.111",
              - "80.192.199.67",
              - "90.197.165.203",
            ]
            # (3 unchanged attributes hidden)
        }

        # (3 unchanged blocks hidden)
    }

  # module.dm_store_storage_account.time_rotating.rotate will be created
  + resource "time_rotating" "rotate" {
      + day              = (known after apply)
      + hour             = (known after apply)
      + id               = (known after apply)
      + minute           = (known after apply)
      + month            = (known after apply)
      + rfc3339          = (known after apply)
      + rotation_days    = 360
      + rotation_rfc3339 = (known after apply)
      + second           = (known after apply)
      + unix             = (known after apply)
      + year             = (known after apply)
    }

  # module.dm_store_storage_account.time_static.pim_expiry must be replaced
-/+ resource "time_static" "pim_expiry" {
      ~ day     = 15 -> (known after apply)
      ~ hour    = 14 -> (known after apply)
      ~ id      = "2024-11-15T14:05:33Z" -> (known after apply)
      ~ minute  = 5 -> (known after apply)
      ~ month   = 11 -> (known after apply)
      ~ rfc3339 = "2024-11-15T14:05:33Z" # forces replacement -> (known after apply) # forces replacement
      ~ second  = 33 -> (known after apply)
      ~ unix    = 1731679533 -> (known after apply)
      ~ year    = 2024 -> (known after apply)
    }

  # module.storage_account.azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
      ~ cross_tenant_replication_enabled  = true -> false
        id                                = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/ccd-shared-prod/providers/Microsoft.Storage/storageAccounts/ccdsharedprod"
        name                              = "ccdsharedprod"
        tags                              = {
            "Destroy Me"          = "No"
            "Team Contact"        = "#ccd-devops"
            "application"         = "core-case-data"
            "builtFrom"           = "https://github.com/HMCTS/ccd-shared-infrastructure.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#ccd-community"
            "environment"         = "production"
            "managedBy"           = "CCD"
        }
        # (39 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.storage_account.time_rotating.rotate will be created
  + resource "time_rotating" "rotate" {
      + day              = (known after apply)
      + hour             = (known after apply)
      + id               = (known after apply)
      + minute           = (known after apply)
      + month            = (known after apply)
      + rfc3339          = (known after apply)
      + rotation_days    = 360
      + rotation_rfc3339 = (known after apply)
      + second           = (known after apply)
      + unix             = (known after apply)
      + year             = (known after apply)
    }

  # module.storage_account.time_static.pim_expiry must be replaced
-/+ resource "time_static" "pim_expiry" {
      ~ day     = 15 -> (known after apply)
      ~ hour    = 14 -> (known after apply)
      ~ id      = "2024-11-15T14:05:33Z" -> (known after apply)
      ~ minute  = 5 -> (known after apply)
      ~ month   = 11 -> (known after apply)
      ~ rfc3339 = "2024-11-15T14:05:33Z" # forces replacement -> (known after apply) # forces replacement
      ~ second  = 33 -> (known after apply)
      ~ unix    = 1731679533 -> (known after apply)
      ~ year    = 2024 -> (known after apply)
    }

Plan: 4 to add, 2 to change, 2 to destroy.
```

</details>


<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.dm_store_storage_account.time_rotating.rotate has been deleted
  - resource "time_rotating" "rotate" {
        id               = "2023-11-21T14:05:33Z"
      - rotation_rfc3339 = "2024-11-15T14:05:33Z" -> null
        # (9 unchanged attributes hidden)
    }

  # module.storage_account.time_rotating.rotate has been deleted
  - resource "time_rotating" "rotate" {
        id               = "2023-11-21T14:05:33Z"
      - rotation_rfc3339 = "2024-11-15T14:05:33Z" -> null
        # (9 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","PRNumber":198,"Program":"tfcmt","SHA1":"","Target":"prod","Vars":{}} -->